app/views/articles/_article.html.erb

        </div>
        <% if article.categories.any? %>
---
SELECT "categories".* FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ?  [["article_id", 4]]
SELECT  1 AS one FROM "categories" INNER JOIN "article_categories" ON "categories"."id" = "article_categories"."category_id" WHERE "article_categories"."article_id" = ? LIMIT ?  [["article_id", 4], ["LIMIT", 1]]