app/controllers/articles_controller.rb

  def index
    @articles = Article.paginate(page: params[:page], per_page: 5)
---
SELECT COUNT(*) FROM "articles"