app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "First Article"], ["description", "First Article"], ["created_at", "2018-12-07 05:09:56.741340"], ["updated_at", "2018-12-07 05:09:56.741340"]]
---
  def create
    @article = Article.new(article_params)
    if @article.save