app/controllers/users_controller.rb

  def show
    @user_articles = @user.articles.paginate(page:params[:page], per_page: 5)
---
SELECT COUNT(*) FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 2]]
SELECT "articles".* FROM "articles" WHERE "articles"."user_id" = ?  [["user_id", 3]]